fishes_config/src/Documents/ПродажаРыб/ПродажаРыб.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПродажаРыб</name>
  <registerRecords>AccumulationRegister.ОстаткиПоРыбе</registerRecords>
  <registerRecords>AccumulationRegister.РегистрПродажи</registerRecords>
  <tabularSections>
    <name>ПродажаРыб_таблица</name>
    <attributes>
      <name>Аквариум</name>
      <type>
        <types>CatalogRef.Аквариумы</types>
      </type>
    </attributes>
    <attributes>
      <name>ПородаРыб</name>
      <type>
        <types>CatalogRef.ПородыРыб</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаПродажи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fishes_config/src/AccumulationRegisters/ОстаткиПоРыбе/ОстаткиПоРыбе.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиПоРыбе</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Аквариум</name>
    <type>
      <types>CatalogRef.Аквариумы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПородаРыб</name>
    <type>
      <types>CatalogRef.ПородыРыб</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fishes_config/src/AccumulationRegisters/РегистрПродажи/РегистрПродажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РегистрПродажи</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаПродажи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Себестоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Аквариум</name>
    <type>
      <types>CatalogRef.Аквариумы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПородаРыб</name>
    <type>
      <types>CatalogRef.ПородыРыб</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fishes_config/src/Documents/ПродажаРыб/ObjectModule.bsl
#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.ОстаткиПоРыбе.Записывать = Истина;
	Движения.РегистрПродажи.Записывать = Истина;
	
	
	ЗапросПоОстаткам = Новый Запрос;
	ЗапросПоОстаткам.Текст = "ВЫБРАТЬ
	|	т.Аквариум КАК Аквариум,
	|	т.ПородаРыб КАК Порода,
	|	т.КоличествоОстаток КАК Количество,
	|	т.СтоимостьОстаток КАК Стоимость
	|ИЗ
	|	РегистрНакопления.ОстаткиПоРыбе.Остатки(&МоментВремени) КАК т";
	ЗапросПоОстаткам.УстановитьПараметр("МоментВремени", МоментВремени());
	Таблица = ЗапросПоОстаткам.Выполнить().Выгрузить();
	
	Для Каждого Строка Из ПродажаРыб_таблица Цикл
		Отбор = Новый Структура("Аквариум, Порода", Строка.Аквариум, Строка.ПородаРыб);
		РезультатПоиска = Таблица.НайтиСтроки(Отбор);
		
		ОстатокКоличество = 0;
		ОстатокСтоимость = 0;
		
		Если РезультатПоиска.Количество() > 0 Тогда
			ОстатокКоличество = РезультатПоиска[0].Количество;
			ОстатокСтоимость = РезультатПоиска[0].Стоимость;
		КонецЕсли;
		
		Если ОстатокКоличество < Строка.Количество Тогда
			Сообщение = Новый СообщениеПользователю;
            Сообщение.Текст = "Недостаточно рыб: " + Строка.ПородаРыб
                + " в " + Строка.Аквариум;
            Сообщение.Сообщить();
            Отказ = Истина;
            Возврат;
		КонецЕсли;
		
		СредняяСебестоимость = ОстатокСтоимость / ОстатокКоличество;
		СебестоимостьСписания = СредняяСебестоимость * Строка.Количество;
		
		ДвижениеОстатки = Движения.ОстаткиПоРыбе.Добавить();
        ДвижениеОстатки.ВидДвижения = ВидДвиженияНакопления.Расход;
        ДвижениеОстатки.Период = Дата;
        ДвижениеОстатки.Аквариум = Строка.Аквариум;
        ДвижениеОстатки.ПородаРыб = Строка.ПородаРыб;
        ДвижениеОстатки.Количество = Строка.Количество;
        ДвижениеОстатки.Стоимость = СебестоимостьСписания;
        
        ДвижениеПродажи = Движения.РегистрПродажи.Добавить();
        ДвижениеПродажи.Период = Дата;
        ДвижениеПродажи.Аквариум = Строка.Аквариум;
        ДвижениеПродажи.ПородаРыб = Строка.ПородаРыб;
        ДвижениеПродажи.Количество = Строка.Количество;
        ДвижениеПродажи.СуммаПродажи = Строка.Сумма;
        ДвижениеПродажи.Себестоимость = СебестоимостьСписания;
	
	КонецЦикла;
		
КонецПроцедуры
#КонецОбласти
